# 5. Користувач вводить змiннi "x" та "y" з довiльними цифровими значеннями;
# -  Створiть просту умовну конструкцiю(звiсно вона повинна бути в тiлi ф-цiї), 
#    пiд час виконання якої буде перевiрятися рiвнiсть змiнних "x" та "y" і при нерiвностi змiнних "х" та "у" вiдповiдь повертали рiзницю чисел.
# -  Повиннi опрацювати такi умови:
# -  x > y;       вiдповiдь - х бiльше нiж у на z
# -  x < y;       вiдповiдь - у бiльше нiж х на z
# -  x == y.      вiдповiдь - х дорiвнює y

x = int(input("Enter x: "))
y = int(input("Enter y: "))

def proverka(x,y):
  if x == y:
    print("x=y=" + str(x))
  elif x > y:
    return x-y
  if x < y:
    return y-x
    
print (proverka(x,y))    
